tutorials/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/system/porous/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousToair
{
    type            constantHeatTransfer;
    active          on;
    selectionMode   mapRegion;
    interpolationMethod cellVolumeWeight;
    nbrRegionName   air;
    master          true;

    constantHeatTransferCoeffs
    {
        nbrModelName    airToporous;
        fieldNames      (h);
        semiImplicit    no;
    }
}

// ************************************************************************* //
